app/views/events/show.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "events_tags" ON "tags"."id" = "events_tags"."tag_id" WHERE "events_tags"."event_id" = 1
---
	</tr>
	<% @event.tags.each do |tag| %>