app/views/tags/show.html.erb

SELECT "events".* FROM "events" INNER JOIN "events_tags" ON "events"."id" = "events_tags"."event_id" WHERE "events_tags"."tag_id" = 1
---
	</tr>
<% @tag.events.each do |event| %>