app/controllers/events_controller.rb

INSERT INTO "events" ("created_at", "end_date", "event_name", "frequency", "location", "notes", "recurrence_day", "recurrence_end_count", "recurrence_end_date", "recurrence_frequency", "start_date", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "events" SET "recurrence_frequency" = 2, "recurrence_end_date" = '2013-12-24 00:00:00.000000', "recurrence_end_count" = NULL, "recurrence_day" = 'MO, WE, FR', "updated_at" = '2013-08-16 02:22:00.532926' WHERE "events"."id" = 1
---
  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])

SELECT "events".* FROM "events"
---
  def ics
    @events = Event.all