app/controllers/requests_controller.rb

SELECT "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @request = Request.find(params[:id])

INSERT INTO "requests" ("approved", "created_at", "email", "updated_at", "validated") VALUES (?, ?, ?, ?, ?)  [["approved", nil], ["created_at", Tue, 13 Aug 2013 05:19:47 UTC +00:00], ["email", "brennan@brennanmeadowcroft.com"], ["updated_at", Tue, 13 Aug 2013 05:19:47 UTC +00:00], ["validated", nil]]
---
  def create
    @request = Request.new(params[:request])

    respond_to do |format|
      if @request.save

SELECT "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "requests" SET "verification_code" = 'vprqexc', "updated_at" = '2013-08-14 04:02:17.411341' WHERE "requests"."id" = 4
---
  def validate
    @request = Request.find(params[:id])
    @code = params[:code]

    if @request.verification_code = @code
      @request.validate
    end

    respond_to do |format|
      if @request.save!

SELECT "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT 1  [["id", "4"]]
---
  def validation_success
    @request = Request.find(params[:id])

SELECT "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT 1  [["id", "4"]]
---
  def resend_validation
    @request = Request.find(params[:id])

SELECT "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "requests" WHERE "requests"."id" = ?  [["id", 1]]
---
  def destroy
    @request = Request.find(params[:id])
    @request.destroy