app/controllers/suggestions_controller.rb

SELECT "suggestions".* FROM "suggestions"
---
  def index
    @suggestions = Suggestion.all

SELECT "suggestions".* FROM "suggestions" WHERE "suggestions"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @suggestion = Suggestion.find(params[:id])

INSERT INTO "suggestions" ("content", "created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @suggestion = Suggestion.new(params[:suggestion])

    respond_to do |format|
      if @suggestion.save