app/controllers/tags_controller.rb

SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @tag = Tag.find(params[:id])

INSERT INTO "tags" ("created_at", "description", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 15 Aug 2013 21:14:55 UTC +00:00], ["description", "Beer"], ["updated_at", Thu, 15 Aug 2013 21:14:55 UTC +00:00]]
---
  def create
    @tag = Tag.new(params[:tag])

    respond_to do |format|
      if @tag.save

SELECT "tags".* FROM "tags" WHERE (description like '%b%')
---
  def tag_list
    @tags = Tag.where("description like ?", "%#{params[:q]}%")